<?php

function gen_pwd($number)
{
    $letters = array(
    'a','b','c','d','e','f','g','h','i','j','k','l','m','n','o','p','r','s','t','u','v','x','y','z',
    'a','b','c','d','e','f','g','h','i','j','k','l','m','n','o','p','r','s','t','u','v','x','y','z',
    'A','B','C','D','E','F','G','H','I','J','K','L','M','N','O','P','R','S','T','U','V','X','Y','Z',
    'A','B','C','D','E','F','G','H','I','J','K','L','M','N','O','P','R','S','T','U','V','X','Y','Z',
    '1','2','3','4','5','6','7','8','9','0','1','2','3','4','5','6','7','8','9','0','.','_','-','.','_','-');
    shuffle($letters);
    $pass = $letters[0];
    for ($i = 1; $i < $number; $i++) {
        $pass .= $letters[$i];
    }
    return $pass;
}

function translit($text)
{
    $trans = array( "а" => "a",
    "б" => "b","в" => "v","г" => "g","д" => "d","е" => "e","ё" => "e","ж" => "zh","з" => "z",
    "и" => "i","й" => "y","к" => "k","л" => "l","м" => "m","н" => "n","о" => "o","п" => "p",
    "р" => "r","с" => "s","т" => "t","у" => "u","ф" => "f","х" => "kh","ц" => "ts","ч" => "ch",
    "ш" => "sh","щ" => "shch","ы" => "y","э" => "e","ю" => "yu","я" => "ya","А" => "A","Б" => "B",
    "В" => "V","Г" => "G","Д" => "D","Е" => "E","Ё" => "E","Ж" => "Zh","З" => "Z","И" => "I",
    "Й" => "Y","К" => "K","Л" => "L","М" => "M","Н" => "N","О" => "O","П" => "P","Р" => "R","С" => "S",
    "Т" => "T","У" => "U","Ф" => "F","Х" => "Kh","Ц" => "Ts","Ч" => "Ch","Ш" => "Sh","Щ" => "Shch",
    "Ы" => "Y","Э" => "E","Ю" => "Yu","Я" => "Ya","ь" => "","Ь" => "","ъ" => "","Ъ" => "");
    if (preg_match("/[а-яА-Я]/", $text)) {
        return strtr($text, $trans);
    } else {
        return $text;
    }
}

$_small_to_big = array(
"а" => "А", "б" => "Б", "в" => "В", "г" => "Г", "д" => "Д", "е" => "Е","ё" => "Ё", "ж" => "Ж","з" => "З",
"и" => "И","й" => "Й","к" => "К","л" => "Л","м" => "М","н" => "Н","о" => "О","п" => "П",
"р" => "Р","с" => "С","т" => "Т","у" => "У","ф" => "Ф","х" => "Х","ц" => "Ц","ч" => "Ч",
"ш" => "Ш","щ" => "Щ", "ы" => "Ы","э" => "Э","ю" => "Ю","я" => "Я","ь" => "Ь","ъ" => "Ъ");

$_big_to_small = array(
"А" => "а","Б" => "б", "В" => "в","Г" => "г","Д" => "д","Е" => "е","Ё" => "ё","Ж" => "ж","З" => "з",
"И" => "и", "Й" => "й","К" => "к","Л" => "л","М" => "м","Н" => "н","О" => "о","П" => "п",
"Р" => "р","С" => "с", "Т" => "т","У" => "у","Ф" => "ф","Х" => "х","Ц" => "ц","Ч" => "ч",
"Ш" => "ш","Щ" => "щ", "Ы" => "ы","Э" => "э","Ю" => "ю","Я" => "я", "Ь" => "ь","Ъ" => "ъ");


function ucfirst_r($text)
{
    global $_small_to_big, $_big_to_small;
    if (strlen($text) == 0) {
        return '';
    }
    $w = strtr($text, $_big_to_small);
    $w[0] = strtr($w[0], $_small_to_big);
    return $w . '';
}

function strtolower_r($text)
{
    global $_big_to_small;
    if (strlen($text) == 0) {
        return '';
    }
    return strtr($text, $_big_to_small) . '';
}

function strtoupper_r($text)
{
    global $_small_to_big;
    if (strlen($text) == 0) {
        return '';
    }
    return strtr($text, $_small_to_big) . '';
}
